{
  "format": "layers-model",
  "generatedBy": "keras v3.12.0",
  "convertedBy": "Custom Keras Converter",
  "modelTopology": {
    "className": "Sequential",
    "config": {
      "name": "LSTM_Model",
      "layers": [
        {
          "className": "Embedding",
          "config": {
            "name": "embedding_1",
            "trainable": true,
            "dtype": "float32",
            "inputDim": 10000,
            "outputDim": 128,
            "embeddingsInitializer": {
              "className": "RandomUniform",
              "config": {
                "seed": null,
                "minval": -0.05,
                "maxval": 0.05
              }
            },
            "maskZero": false,
            "inputLength": 100
          }
        },
        {
          "className": "LSTM",
          "config": {
            "name": "lstm_1",
            "trainable": true,
            "dtype": "float32",
            "returnSequences": false,
            "returnState": false,
            "goBackwards": false,
            "stateful": false,
            "unroll": false,
            "zeroOutputForMask": false,
            "units": 64,
            "activation": "tanh",
            "recurrentActivation": "sigmoid",
            "useBias": true,
            "kernelInitializer": {
              "className": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "recurrentInitializer": {
              "className": "Orthogonal",
              "config": {
                "seed": null,
                "gain": 1.0
              }
            },
            "biasInitializer": {
              "className": "Zeros",
              "config": {}
            },
            "unitForgetBias": true,
            "dropout": 0.0,
            "recurrentDropout": 0.0,
            "seed": null
          }
        },
        {
          "className": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "className": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "className": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "biasInitializer": {
              "className": "Zeros",
              "config": {}
            }
          }
        },
        {
          "className": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "className": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "useBias": true,
            "kernelInitializer": {
              "className": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "biasInitializer": {
              "className": "Zeros",
              "config": {}
            }
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "embedding_1/embeddings",
          "shape": [
            10000,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/kernel",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "trainingConfig": null
}