{
  "format": "graph-model",
  "generatedBy": "TensorFlow.js tfjs-converter v1.0.0",
  "convertedBy": "Custom SavedModel converter",
  "modelTopology": {
    "node": [],
    "library": {},
    "versions": {}
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "LSTM_Model/embedding_1/embeddings:0",
          "shape": [
            10000,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_Model/lstm/lstm_cell/kernel:0",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_Model/lstm/lstm_cell/recurrent_kernel:0",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_Model/lstm/lstm_cell/bias:0",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_Model/dense_2/kernel:0",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_Model/dense_2/bias:0",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_Model/dense_3/kernel:0",
          "shape": [
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "LSTM_Model/dense_3/bias:0",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "seed_generator_5/seed_generator_state:0",
          "shape": [
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "seed_generator_6/seed_generator_state:0",
          "shape": [
            2
          ],
          "dtype": "float32"
        },
        {
          "name": "seed_generator_7/seed_generator_state:0",
          "shape": [
            2
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "signature": {
    "inputs": {
      "input": {
        "name": "input_layer_1",
        "dtype": "<dtype: 'float32'>",
        "tensorShape": {
          "dim": [
            {
              "size": "100"
            }
          ]
        }
      }
    },
    "outputs": {}
  }
}