{
  "format": "layers-model",
  "generatedBy": "keras v3.12.0",
  "convertedBy": "Custom Keras Converter",
  "modelTopology": {
    "className": "Sequential",
    "config": {
      "name": "BiLSTM_Model",
      "layers": [
        {
          "className": "Embedding",
          "config": {
            "name": "embedding_1",
            "trainable": true,
            "dtype": "float32",
            "inputDim": 10000,
            "outputDim": 128,
            "embeddingsInitializer": {
              "className": "RandomUniform",
              "config": {
                "seed": null,
                "minval": -0.05,
                "maxval": 0.05
              }
            },
            "maskZero": false,
            "inputLength": 100
          }
        },
        {
          "className": "Bidirectional",
          "config": {
            "merge_mode": "concat",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_LSTM1",
                "trainable": true,
                "units": 64,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "className": "GlorotUniform",
                  "config": {
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "className": "Orthogonal",
                  "config": {
                    "seed": null,
                    "gain": 1.0
                  }
                },
                "bias_initializer": {
                  "className": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0,
                "implementation": null,
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false
              }
            },
            "name": "bidirectional_1",
            "trainable": true
          }
        },
        {
          "className": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "className": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "useBias": true,
            "kernelInitializer": {
              "className": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "biasInitializer": {
              "className": "Zeros",
              "config": {}
            }
          }
        },
        {
          "className": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.5,
            "seed": null,
            "noiseShape": null
          }
        },
        {
          "className": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "sigmoid",
            "useBias": true,
            "kernelInitializer": {
              "className": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "biasInitializer": {
              "className": "Zeros",
              "config": {}
            }
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "embedding_1/embeddings",
          "shape": [
            10000,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_LSTM1/kernel",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_LSTM1/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_LSTM1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_LSTM1/kernel",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_LSTM1/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_LSTM1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "trainingConfig": null
}